"""
Создать txt-файл, вставить туда любую англоязычную статью из Википедии.
Реализовать одну функцию, которая выполняет следующие операции:
- прочитать файл построчно;
- непустые строки добавить в список;
- удалить из каждой строки все цифры, знаки препинания, скобки, кавычки и т.д. (остаются латинские буквы и пробелы);
- объединить все строки из списка в одну, используя метод join и пробел, как разделитель;
- создать словарь вида {“слово”: количество, “слово”: количество, … } для подсчета количества разных слов,
  где ключом будет уникальное слово, а значением - количество;
- вывести в порядке убывания 10 наиболее популярных слов, используя форматирование
  (вывод примерно следующего вида: “ 1 place --- sun --- 15 times \n....”);
- заменить все эти слова в строке на слово “PYTHON”;
- создать новый txt-файл;
- записать строку в файл, разбивая на строки, при этом на каждой строке записывать не более 100 символов
  при этом не делить слова.
"""

def wiki_function():
    # -----------------------------------------------------------------------------------------------
# Вывод текса построчно
    file=open('C:\\Users\\polon\\Desktop\\pract\B\\a.txt')
    k=0
    s=[]
 #   print("\n\n\nВывод текса построчно\n\n\n")

    for row in file:
  #      print(row)
 # ---------------------------------------------------------------
#Список без пустых строк
        if row!="\n":
            s.append(row)

#    print("\n\n\n\nСписок без пустых строк:\n\n\n",s,"\n\n\n")
#    print("-----------------------------------------------")
    # ------------------------------------------------------------------------------------------------
    # Список без лишних символов
    k=0
    for row in s:
        for i in row:
            if i.isalpha()==False and i!=" ":
                row=row.replace(i,"")
        s[k]=row
        k+=1
#    print("\n\n\n\nСписок без лишних символов:\n\n\n",s)
#--------------------------------------------------------------------------
    # Oбъединенный список в строку
    s_str = " ".join(s)
   # print("\n\n\n\nОбъединенный список в строку:\n\n\n", s_str)
   # print("\n\n\n----------------------------------------------")
    #-----------------------------------------------------------------------------------------
    # Словарь с количеством слов
    s.clear()
    s=s_str.lower().split()
    a={}
    for i in range(0,len(s)):
        a.setdefault(s[i],0)
        if a[s[i]]==0:
            for i1 in range(0,len(s)):
                if s[i]==s[i1]:
                    a[s[i]]+=1
 #   print("\n\n\n\nСловарь с количеством слов:\n\n\n", a)
 #   print("\n\n\n----------------------------------------------")

    #------------------------------------------------------------------------
    # 10 популярных слов
    sor=list(a.values())
    sor.sort()
    k=0
    top=""
    for i in range(len(sor)-1,-1,-1):
        if sor[i]==sor[i-1]:
            continue
        for key in a:
            if a[key]==sor[i]:
                k+=1
                #Замена слов
                keyb=key[0].upper()+key[1:]
                for word in range(0,len(s)):
                    if s[word]==key or s[word]==keyb:
                        s[word]="PYTHON"
                #----------------
                top+='{0} place --- {1} --- {2} times\n'.format(k,key,sor[i])
                if (k == 10):
                    break
        if (k==10):
            break
    print("\n\n\n\n10 популярных слов:\n\n\n", top)
    print("\n\n\n----------------------------------------------")



    s_str=" ".join(s)
#    print("\n\n\nТекст с замененными словами :\n\n\n", s_str)
  #  print("\n\n\n----------------------------------------------")
    my_file=open("C:\\Users\\polon\\Desktop\\pract\\B\\b.txt","w")
    ss=""
    k=0
#---------------------------------------------------------------------------------
# Cоздание txt файла и запись в него
    for i in range(0,len(s_str)):

        if i-k==99:
            if s_str[i]==" " or s_str[i+1]==" " or len(s_str)==i-1:

                my_file.write(s_str[k:i+1]+"\n")
                if s_str[i]==" ":
                    k=i+1
                elif s_str[i+1]==" ":
                    k=i+2

            else:
                for i1 in range(i,k,-1):
                    if s_str[i1]==" ":

                        my_file.write(s_str[k:i1+1] +"\n")
                        k = i1+1
                        break
        elif len(s_str)-1==i:
            my_file.write(s_str[k:i + 1])
    return 1


# Вызов функции
wiki_function()